Create DataFrame in pandas

In [5]:
import pandas as pd
dict={
    "Faculty Name":["Avinash","Bhavesh","Vishesh","Rohit","Sachin"],
    "Salary":[10292,11028,15302,12000,15556],
    "Dept":["CSE","ECE","ME","CSE","EC"]}
df=pd.DataFrame(dict)
df

  Faculty Name  Salary Dept
0      Avinash   10292  CSE
1      Bhavesh   11028  ECE
2      Vishesh   15302   ME
3        Rohit   12000  CSE
4       Sachin   15556   EC

To save DataFrame to facultyDetails.csv

In [6]:
df.to_csv("FacultyDetails.csv")